DoS Testmessages/Metro-Sign_originalMessage.xml

<soapenv:Envelope xmlns:met="http://metro1.kmzs.ba/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><ds:Signature Id="SIG-9A85B8857C8D1B04D514741466448695" xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="met soapenv" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/><ds:Reference URI="#id-9A85B8857C8D1B04D514741466448644"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"><ec:InclusiveNamespaces PrefixList="met" xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"/></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/><ds:DigestValue>pe1vmZDSv3ud5UKXyh1zfqkdpTw=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>Psa/MVcyMbsUVpWzHZAwa15vZY0yvr1cn8EBNcJRtMS1K54Ec5mkIofgIgGxM/bCsdx7alZ5W8ma
J9LvTOX0kYbyKKg/Orslpxo6vf5uCUnzBlQD4rLqL+aQlpKffjJV1dIvqLU7YPIJJ179pgOB2pAK
U1PYbaJNx3yIeBpyzefevBa+gr+FjvBbz9TVCDCUw5xJO2xTjia84pDGKuvCNYNhfibdCFFJp+td
xF0TOOCZEu3no99at84JfCwWX9JGsk6lgKR5jxQ72LhZ9jX0bEDpeaXXMJtEUdKmiusLYojqVmyy
bybm4Cxeic3YoAR1zMe7pM7YAByr5ROu9rR6Iw==</ds:SignatureValue><ds:KeyInfo Id="KI-9A85B8857C8D1B04D514741466448542"><wsse:SecurityTokenReference wsu:Id="STR-9A85B8857C8D1B04D514741466448573"><ds:X509Data><ds:X509IssuerSerial><ds:X509IssuerName>CN=client</ds:X509IssuerName><ds:X509SerialNumber>1034513739</ds:X509SerialNumber></ds:X509IssuerSerial></ds:X509Data></wsse:SecurityTokenReference></ds:KeyInfo></ds:Signature></wsse:Security></soapenv:Header>
   <soapenv:Body wsu:Id="id-9A85B8857C8D1B04D514741466448644" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <met:getAdminToken/>
   </soapenv:Body>
</soapenv:Envelope>